bit-finance/Documents/бит_кзн_РеестрПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_РеестрПлатежей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_РеестрыПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПлатежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежнаяПозиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаПлатежнаяПозиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОдиночнаяПозиция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаблокироватьСтроку</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

bit-finance/InformationRegisters/бит_РеестрыПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_РеестрыПлатежей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПлатежнаяПозиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/бит_СтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СтатусыОбъектов</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПредыдущий</Name>
					<Comment>Статус предыдущий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзмененияСтатуса</Name>
					<Comment>Дата изменения статуса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыСоСтатусами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/AccumulationRegisters/бит_кзн_ПланируемыйРасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_кзн_ПланируемыйРасходДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/ВалютыИКурсыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВалютыИКурсыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КурсЧислительВалютыВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсЗнаменательВалютыВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсЧислительВалютыУправленческогоУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсЗнаменательВалютыУправленческогоУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсЧислительВалютыДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсЗнаменательВалютыДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаРегламентированногоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетДавальцу</v8:Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПремииКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПринятыхНаХранениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОператораСистемыПлатон</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыКлиентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПремииПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетДавальцу2_5</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОСписанииТоваровСХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыУПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика2_5</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупТоваровХранителем</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОЗакупках</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетДавальцуМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыДенежныхСредств</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Наличные</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
					<Comment>Безналичные</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Documents/бит_кзн_РеестрПлатежей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли; 
	
	УстановитьИсключениеПроверкиСтатусаОплаты();
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ПодготовитьОбъектыДляОбновленияСтатуса();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 	
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		ЗначениеДокументОснование = Неопределено;
		Если ДанныеЗаполнения.Свойство("ДокументОснование", ЗначениеДокументОснование) Тогда
			Если ТипЗнч(ЗначениеДокументОснование) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
				МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначениеДокументОснование);
				ЗаполнитьПоЗаявкам(МассивДокументов);	
			ИначеЕсли ТипЗнч(ЗначениеДокументОснование) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
				МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначениеДокументОснование);
				ЗаполнитьПоПозициям(МассивДокументов);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") 
		И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		ЗаполнитьПоЗаявкам(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") 
		И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
		ЗаполнитьПоПозициям(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеЗаполнения);
		ЗаполнитьПоЗаявкам(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
		МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеЗаполнения);
		ЗаполнитьПоПозициям(ДанныеЗаполнения);	
	КонецЕсли;
	
	ЗначениеОрганизация = Неопределено;
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")  Тогда
			ДанныеЗаполнения.Свойство("Организация", ЗначениеОрганизация);
		ИначеЕсли ТаблицаПлатежи.Количество() > 0 Тогда 	
			ЗначениеОрганизация = Организация;
		КонецЕсли;
	КонецЕсли;
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), Неопределено);
	
	Если ЗначениеОрганизация <> Неопределено Тогда
		Организация = ЗначениеОрганизация;	
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	ПроверкаЗаполненияСпискаПлатежей(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект);

	ПараметрыПроведения = Документы.бит_кзн_РеестрПлатежей.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	Документы.бит_кзн_РеестрПлатежей.СформироватьРеестрыПлатежей(
		ПараметрыПроведения.РеестрПлатежейТаблица, 
		ПараметрыПроведения.РеестрПлатежейРеквизиты, Движения);
		
	ОбновитьСтатусыЗаявок();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	ОбновитьСтатусыЗаявок();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаЗаполненияСпискаПлатежей(Отказ)

	Позиции = Новый Соответствие; 

	ШаблонСообщения = НСтр("ru = 'Значение повторяется.'; en = 'The value is repeated.'");
	СинонимПоля 	= НСтр("ru = 'Заявка/Платежная позиция'; en = 'Application / Payment position'");
	СинонимТаблицы  = НСтр("ru = 'Платежи'; en = 'Payments'");
	
	Если НЕ ЗначениеЗаполнено(ТаблицаПлатежи) Тогда
		Возврат;	
	КонецЕсли;

	// Дублирование.
	Для каждого СтрокаТаблицы Из ТаблицаПлатежи Цикл
		Если Позиции.Получить(СтрокаТаблицы.ПлатежнаяПозиция) <> Неопределено Тогда
			Поле = "ТаблицаПлатежи[%1].ПлатежнаяПозиция";
			Поле = СтрШаблон(Поле, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
								"КОЛОНКА", "КОРРЕКТНОСТЬ", СинонимПоля,
								СтрокаТаблицы.НомерСтроки, СинонимТаблицы, ШаблонСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		Иначе	
			Позиции.Вставить(СтрокаТаблицы.ПлатежнаяПозиция, СтрокаТаблицы.НомерСтроки);
		КонецЕсли;
	КонецЦикла; 	
	
	// Включение в реестр.
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ВключатьПлатежнуюПозициюВНесколькоРеестров") Тогда
		СписокПлатежей = ТаблицаПлатежи.ВыгрузитьКолонки("ПлатежнаяПозиция");
		СписокПлатежей.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(4));
		СписокПлатежей.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.бит_кзн_РеестрПлатежей"));
		
		Для каждого СтрокаТаблицы Из ТаблицаПлатежи Цикл
			НоваяСтрока = СписокПлатежей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.НомерСтроки = СписокПлатежей.Количество();
			НоваяСтрока.Ссылка 		= Ссылка;
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СписокПлатежей", СписокПлатежей);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Список.НомерСтроки КАК НомерСтроки,
		|	Список.Ссылка КАК Ссылка,
		|	Список.ПлатежнаяПозиция КАК ПлатежнаяПозиция
		|ПОМЕСТИТЬ СписокПлатежей
		|ИЗ
		|	&СписокПлатежей КАК Список
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокПлатежей.НомерСтроки КАК НомерСтроки,
		|	СписокПлатежей.ПлатежнаяПозиция КАК ПлатежнаяПозиция,
		|	РеестрыПлатежей.РеестрПлатежей КАК РеестрПлатежей
		|ИЗ
		|	СписокПлатежей КАК СписокПлатежей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_РеестрыПлатежей КАК РеестрыПлатежей
		|		ПО СписокПлатежей.ПлатежнаяПозиция = РеестрыПлатежей.ПлатежнаяПозиция
		|			И СписокПлатежей.Ссылка <> РеестрыПлатежей.РеестрПлатежей";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка 		 = РезультатЗапроса.Выбрать();
		
		ШаблонСообщения = НСтр("ru = 'Документ %1 включен в реестр %2.'; en = 'The document %1 is included in the registry %2.'");
		
		Пока Выборка.Следующий() Цикл
			
			Пояснение = СтрШаблон(ШаблонСообщения, Выборка.ПлатежнаяПозиция, Выборка.РеестрПлатежей);
			Поле 	  = "ТаблицаПлатежи[%1].ПлатежнаяПозиция";
			Поле 	  = СтрШаблон(Поле, Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"КОЛОНКА", "КОРРЕКТНОСТЬ", СинонимПоля,
				Выборка.НомерСтроки, СинонимТаблицы, Пояснение);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры

Процедура ПодготовитьОбъектыДляОбновленияСтатуса()
	
	МассивОбъектов = ТаблицаПлатежи.ВыгрузитьКолонку("ЗаявкаПлатежнаяПозиция"); 
	МассивПозиций  = ТаблицаПлатежи.ВыгрузитьКолонку("ПлатежнаяПозиция");
	Для Каждого НоваяПозиция Из МассивПозиций Цикл
		МассивОбъектов.Добавить(НоваяПозиция);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкиВРеесте.ЗаявкаПлатежнаяПозиция КАК Заявка,
	|	ЗаявкиВРеесте.ПлатежнаяПозиция КАК ПлатежнаяПозиция
	|ИЗ
	|	Документ.бит_кзн_РеестрПлатежей.ТаблицаПлатежи КАК ЗаявкиВРеесте
	|ГДЕ
	|	ЗаявкиВРеесте.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Заявка) Тогда
			МассивОбъектов.Добавить(Выборка.Заявка);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ПлатежнаяПозиция) Тогда
			МассивОбъектов.Добавить(Выборка.ПлатежнаяПозиция);
		КонецЕсли;
	КонецЦикла;
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивОбъектов);
	ДополнительныеСвойства.Вставить("ОбъектыДляОбновленияСтатуса", МассивОбъектов);
	
КонецПроцедуры

Процедура ОбновитьСтатусыЗаявок()
	
	Перем ОбъектыДляОбновленияСтатуса;
	
	Если НЕ ДополнительныеСвойства.Свойство("ОбъектыДляОбновленияСтатуса", ОбъектыДляОбновленияСтатуса) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СсылкаНаОбъект Из ОбъектыДляОбновленияСтатуса Цикл
		Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		
		бит_ВизированиеСервер.УстановитьСтатус(СсылкаНаОбъект.ПолучитьОбъект());
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьИсключениеПроверкиСтатусаОплаты()
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПлатежей.ПлатежныйДокумент КАК ПлатежныйДокумент
	|ПОМЕСТИТЬ ТекущиеПлатежи
	|ИЗ
	|	&ТаблицаПлатежей КАК ТаблицаПлатежей
	|ГДЕ
	|	ТаблицаПлатежей.ПлатежныйДокумент <> НЕОПРЕДЕЛЕНО";
	Запрос.УстановитьПараметр("ТаблицаПлатежей", ТаблицаПлатежи.Выгрузить(, "ПлатежныйДокумент"));
	Запрос.Выполнить();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекущиеПлатежи.ПлатежныйДокумент КАК ПлатежныйДокумент
	|ИЗ
	|	ТекущиеПлатежи КАК ТекущиеПлатежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_кзн_РеестрПлатежей.ТаблицаПлатежи КАК РеестрПлатежей
	|		ПО ТекущиеПлатежи.ПлатежныйДокумент = РеестрПлатежей.ПлатежныйДокумент
	|			И (РеестрПлатежей.Ссылка = &Ссылка)
	|ГДЕ
	|	РеестрПлатежей.ПлатежныйДокумент ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ПлатежныйДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		// Новый платежный документ в табличной части. Необходимо разрешить запись даже в статусе оплачено.
		ДополнительныеСвойства.Вставить("ОтключитьМеханизмПроверкиСтатуса", Истина);
		ДополнительныеСвойства.Вставить("ОтключитьМеханизмНастройкиДоступности", Истина);
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявкам(ДокументыОснования)

	ВыбранныеДокументы = Новый Массив;
	Для каждого ЭлементВыборки Из ДокументыОснования Цикл
		Результат = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(ЭлементВыборки);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВыбранныеДокументы, Результат.МассивПозиций);
	КонецЦикла;
	
	ЗаполнитьПоПозициям(ВыбранныеДокументы);	

КонецПроцедуры

Процедура ЗаполнитьПоПозициям(ВыбранныеДокументы)

	// См. Документы.бит_кзн_РеестрПлатежей.ЗаполнитьСписокПодбораДокументовКОплате().
	
	БазоваяВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаУпр 	  = ЗначениеНастроекПовтИсп.ВалютаУправленческогоУчета();
	Валюта		  = Константы.ВалютаРегламентированногоУчета.Получить(); // ++ NB ???? 
	
	ТипыСтатуса = Новый Массив;
	ТипыСтатуса.Добавить(Перечисления.бит_ТипыСтатусовОбъектов.Утвержден);
	ТипыСтатуса.Добавить(Перечисления.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БазоваяВалюта",		БазоваяВалюта);
	Запрос.УстановитьПараметр("Валюта", 			БазоваяВалюта);
	Запрос.УстановитьПараметр("ВалютаУпр", 			ВалютаУпр);
	Запрос.УстановитьПараметр("ВыбранныеДокументы", ВыбранныеДокументы);
	Запрос.УстановитьПараметр("ПустаяДата",			'0001-01-01');	
	Запрос.УстановитьПараметр("ТипыСтатуса",		ТипыСтатуса);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлатежныеПозиции.Ссылка КАК ПлатежнаяПозиция,
	|	ПлатежныеПозиции.ПометкаУдаления КАК ПометкаУдаления,
	|	ПлатежныеПозиции.Номер КАК Номер,
	|	ПлатежныеПозиции.Дата КАК Дата,
	|	ПлатежныеПозиции.Проведен КАК Проведен,
	|	ПлатежныеПозиции.РучнаяКорректировка КАК РучнаяКорректировка,
	|	ПлатежныеПозиции.ВидПлана КАК ВидПлана,
	|	ПлатежныеПозиции.БанковскийСчет КАК БанковскийСчет,
	|	ПлатежныеПозиции.Важность КАК Важность,
	|	ПлатежныеПозиции.ВалютаДокумента КАК ВалютаДокумента,
	|	ПлатежныеПозиции.ДатаПлан КАК ДатаПлан,
	|	ПлатежныеПозиции.ДатаПланКрайняя КАК ДатаПланКрайняя,
	|	ПлатежныеПозиции.ДокументПланирования КАК ДокументПланирования,
	|	ПлатежныеПозиции.Касса КАК Касса,
	|	ПлатежныеПозиции.Контрагент КАК Контрагент,
	|	ПлатежныеПозиции.Организация КАК Организация,
	|	ПлатежныеПозиции.СверхБюджета КАК СверхБюджета,
	|	ПлатежныеПозиции.СуммаДокумента КАК СуммаДокумента,
	|	ПлатежныеПозиции.СтавкаНДС КАК СтавкаНДС,
	|	ПлатежныеПозиции.СтатьяОборотов КАК СтатьяОборотов,
	|	ПлатежныеПозиции.СуммаНДС КАК СуммаНДС,
	|	ПлатежныеПозиции.Сценарий КАК Сценарий,
	|	ПлатежныеПозиции.ТипПлатежа КАК ТипПлатежа,
	|	ПлатежныеПозиции.ФормаОплаты КАК ФормаОплаты,
	|	ПлатежныеПозиции.ЦФО КАК ЦФО,
	|	ЕСТЬNULL(СтатусыПозиций.Статус, ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.Пустаяссылка)) КАК СтатусПозиции,
	|	ПлатежныеПозиции.Аналитика_1 КАК Аналитика_1,
	|	ПлатежныеПозиции.Аналитика_2 КАК Аналитика_2,
	|	ПлатежныеПозиции.Аналитика_3 КАК Аналитика_3,
	|	ПлатежныеПозиции.Аналитика_4 КАК Аналитика_4,
	|	ПлатежныеПозиции.Аналитика_5 КАК Аналитика_5,
	|	ПлатежныеПозиции.Аналитика_6 КАК Аналитика_6,
	|	ПлатежныеПозиции.Аналитика_7 КАК Аналитика_7,
	|	ПлатежныеПозиции.Аналитика_8 КАК Аналитика_8,
	|	ПлатежныеПозиции.Аналитика_9 КАК Аналитика_9,
	|	ПлатежныеПозиции.Аналитика_11 КАК Аналитика_11,
	|	ПлатежныеПозиции.Аналитика_12 КАК Аналитика_12,
	|	ПлатежныеПозиции.Аналитика_10 КАК Аналитика_10,
	|	ВЫБОР
	|		КОГДА ПлатежныеПозиции.РучнаяКорректировка
	|			ТОГДА ВЫБОР
	|					КОГДА ПлатежныеПозиции.ПометкаУдаления
	|						ТОГДА 10
	|					КОГДА НЕ ПлатежныеПозиции.Проведен
	|						ТОГДА 9
	|					ИНАЧЕ 8
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПлатежныеПозиции.ПометкаУдаления
	|					ТОГДА 2
	|				КОГДА ПлатежныеПозиции.Проведен
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ПозицияСостояние,
	|	ВЫБОР
	|		КОГДА ПлатежныеПозиции.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.бит_ВидыДенежныхСредств.Безналичные)
	|			ТОГДА ПлатежныеПозиции.БанковскийСчет
	|		ИНАЧЕ ПлатежныеПозиции.Касса
	|	КОНЕЦ КАК СчетКасса,
	|	ПлатежныеПозиции.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВЫБОР
	|		КОГДА ПлатежныеПозиции.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.бит_ВидыДенежныхСредств.Безналичные)
	|			ТОГДА ПлатежныеПозиции.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ ПлатежныеПозиции.Касса.ВалютаДенежныхСредств
	|	КОНЕЦ КАК ВалютаДенежныхСредств,
	|	ПлатежныеПозиции.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ПлатежныеПозиции.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ПлатежныеПозиции.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ПлатежныеПозиции.ПланированиеСуммы КАК ПланированиеСуммы,
	|	ВЫБОР
	|		КОГДА ПлатежныеПозиции.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа)
	|			ТОГДА ПлатежныеПозиции.ВалютаДокумента
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПлатежныеПозиции.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.бит_ВидыДенежныхСредств.Безналичные)
	|					ТОГДА ПлатежныеПозиции.БанковскийСчет.ВалютаДенежныхСредств
	|				ИНАЧЕ ПлатежныеПозиции.Касса.ВалютаДенежныхСредств
	|			КОНЕЦ
	|	КОНЕЦ КАК ВалютаПлатежа,
	|	ПлатежныеПозиции.ФизЛицо КАК ФизЛицо,
	|	ПлатежныеПозиции.ОрганизацияПолучатель КАК ОрганизацияПолучатель
	|ПОМЕСТИТЬ ВТПлатежныеПозиции
	|ИЗ
	|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК СтатусыПозиций
	|		ПО ПлатежныеПозиции.Ссылка = СтатусыПозиций.Объект
	|ГДЕ
	|	НЕ ПлатежныеПозиции.ПометкаУдаления
	|	И ПлатежныеПозиции.Ссылка В(&ВыбранныеДокументы) И СтатусыПозиций.Статус.ТипСтатуса В (&ТипыСтатуса)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПлатежнаяПозиция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТПлатежныеПозиции.ПлатежнаяПозиция КАК ПлатежнаяПозиция,
	|	бит_РеестрыПлатежей.РеестрПлатежей ЕСТЬ НЕ NULL  КАК УжеВключенаВРеестр
	|ПОМЕСТИТЬ ВТВключеныВРеестр
	|ИЗ
	|	ВТПлатежныеПозиции КАК ВТПлатежныеПозиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_РеестрыПлатежей КАК бит_РеестрыПлатежей
	|		ПО ВТПлатежныеПозиции.ПлатежнаяПозиция = бит_РеестрыПлатежей.ПлатежнаяПозиция
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПлатежнаяПозиция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиПозиций.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ОстаткиПозиций.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ВТПлатежныеПозиции.ПлатежнаяПозиция КАК ПлатежнаяПозиция
	|ПОМЕСТИТЬ ВТОстаткиПозиций
	|ИЗ
	|	ВТПлатежныеПозиции КАК ВТПлатежныеПозиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.Остатки(
	|				{(&КонецДняДатаОплаты)},
	|				Позиция В
	|					(ВЫБРАТЬ
	|						ВТПлатежныеПозиции.ПлатежнаяПозиция КАК ПлатежнаяПозиция
	|					ИЗ
	|						ВТПлатежныеПозиции КАК ВТПлатежныеПозиции)) КАК ОстаткиПозиций
	|		ПО ВТПлатежныеПозиции.ПлатежнаяПозиция = ОстаткиПозиций.Позиция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкиНаПеревод.Ссылка КАК Ссылка,
	|	ЗаявкиНаПеревод.Дата КАК Дата,
	|	ЗаявкиНаПеревод.Номер КАК Номер,
	|	ЗаявкиНаПеревод.Важность КАК Важность,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаПеревод.ПометкаУдаления
	|			ТОГДА 2
	|		КОГДА ЗаявкиНаПеревод.Проведен
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗаявкаСостояние,
	|	ЕСТЬNULL(СтатусыЗаявок.Статус, ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.Пустаяссылка)) КАК СтатусЗаявки
	|ПОМЕСТИТЬ ВТДанныеЗаявок
	|ИЗ
	|	ВТПлатежныеПозиции КАК ВТПлатежныеПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию КАК ЗаявкиНаПеревод
	|		ПО ВТПлатежныеПозиции.ДокументПланирования = ЗаявкиНаПеревод.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК СтатусыЗаявок
	|		ПО (ЗаявкиНаПеревод.Ссылка = СтатусыЗаявок.Объект)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкиНаПеремещение.Ссылка,
	|	ЗаявкиНаПеремещение.Дата,
	|	ЗаявкиНаПеремещение.Номер,
	|	ЗаявкиНаПеремещение.Важность,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаПеремещение.ПометкаУдаления
	|			ТОГДА 2
	|		КОГДА ЗаявкиНаПеремещение.Проведен
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЕСТЬNULL(СтатусыЗаявок.Статус, ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.Пустаяссылка))
	|ИЗ
	|	ВТПлатежныеПозиции КАК ВТПлатежныеПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств КАК ЗаявкиНаПеремещение
	|		ПО ВТПлатежныеПозиции.ДокументПланирования = ЗаявкиНаПеремещение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК СтатусыЗаявок
	|		ПО (ЗаявкиНаПеремещение.Ссылка = СтатусыЗаявок.Объект)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкиНаРасходование.Ссылка,
	|	ЗаявкиНаРасходование.Дата,
	|	ЗаявкиНаРасходование.Номер,
	|	ЗаявкиНаРасходование.Важность,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаРасходование.ПометкаУдаления
	|			ТОГДА 2
	|		КОГДА ЗаявкиНаРасходование.Проведен
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЕСТЬNULL(СтатусыЗаявок.Статус, ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.Пустаяссылка))
	|ИЗ
	|	ВТПлатежныеПозиции КАК ВТПлатежныеПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ЗаявкаНаРасходованиеСредств КАК ЗаявкиНаРасходование
	|		ПО ВТПлатежныеПозиции.ДокументПланирования = ЗаявкиНаРасходование.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК СтатусыЗаявок
	|		ПО (ЗаявкиНаРасходование.Ссылка = СтатусыЗаявок.Объект)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА ОбъектыРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|				И ЕСТЬNULL(ОбъектыРасчетов.Договор.ВариантКурсаДоговора, ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		ИНАЧЕ ЕСТЬNULL(ОбъектыРасчетов.Договор.ВариантКурсаДоговора, ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный))
	|	КОНЕЦ КАК ВариантКурсаДоговора,
	|	ОбъектыРасчетов.ТипОбъектаРасчетов КАК ТипОбъектаРасчетов,
	|	ЕСТЬNULL(КурсыДокументов.КурсЧислительВалютыВзаиморасчетов, 0) КАК КурсЧислительВалютыВзаиморасчетов,
	|	ЕСТЬNULL(КурсыДокументов.КурсЗнаменательВалютыВзаиморасчетов, 0) КАК КурсЗнаменательВалютыВзаиморасчетов,
	|	ЕСТЬNULL(КурсыДокументов.КурсЧислительВалютыУправленческогоУчета, 0) КАК КурсЧислительВалютыУправленческогоУчета,
	|	ЕСТЬNULL(КурсыДокументов.КурсЗнаменательВалютыУправленческогоУчета, 0) КАК КурсЗнаменательВалютыУправленческогоУчета,
	|	ЕСТЬNULL(КурсыДокументов.КурсЧислительВалютыДокумента, 0) КАК КурсЧислительВалютыДокумента,
	|	ЕСТЬNULL(КурсыДокументов.КурсЗнаменательВалютыДокумента, 0) КАК КурсЗнаменательВалютыДокумента,
	|	ЕСТЬNULL(КурсыДокументов.ВалютаДокумента, 0) КАК ВалютаДокумента,
	|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ОбъектыРасчетов.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ОбъектыРасчетов.Дата КАК Дата,
	|	ЕСТЬNULL(КурсыДоговоров.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодКурсаДоговора,
	|	ЕСТЬNULL(КурсыДоговоров.КурсЧислитель, 0) КАК КурсЧислительВалютыДоговора,
	|	ЕСТЬNULL(КурсыДоговоров.КурсЗнаменатель, 0) КАК КурсЗнаменательВалютыДоговора
	|ПОМЕСТИТЬ ДанныеОбъектаРасчетов
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВалютыИКурсыДокументов КАК КурсыДокументов
	|		ПО ОбъектыРасчетов.Объект = КурсыДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютРасчетовПоДоговорам.СрезПоследних(&ПустаяДата {(&ПустаяДата)}, ) КАК КурсыДоговоров
	|		ПО ОбъектыРасчетов.Договор = КурсыДоговоров.Договор
	|ГДЕ
	|	ОбъектыРасчетов.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.ОбъектРасчетов
	|			ИЗ
	|				ВТПлатежныеПозиции КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОбъектаРасчетов.ВалютаДокумента КАК Валюта,
	|	ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета КАК БазоваяВалюта,
	|	ДанныеОбъектаРасчетов.Дата КАК ДатаКурса,
	|	ДанныеОбъектаРасчетов.КурсЧислительВалютыДокумента КАК КурсЧислитель,
	|	ДанныеОбъектаРасчетов.КурсЗнаменательВалютыДокумента КАК КурсЗнаменатель
	|ПОМЕСТИТЬ ВТКурсыПредварительно
	|ИЗ
	|	ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|ГДЕ
	|	ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|	И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|	И (ДанныеОбъектаРасчетов.ВалютаДокумента В
	|				(ВЫБРАТЬ
	|					Т.ВалютаДокумента
	|				ИЗ
	|					ВТПлатежныеПозиции КАК Т)
	|			ИЛИ ДанныеОбъектаРасчетов.ВалютаДокумента = &Валюта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов,
	|	ДанныеОбъектаРасчетов.ОбъектРасчетов,
	|	ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|	ДанныеОбъектаРасчетов.Дата,
	|	ДанныеОбъектаРасчетов.КурсЧислительВалютыВзаиморасчетов,
	|	ДанныеОбъектаРасчетов.КурсЗнаменательВалютыВзаиморасчетов
	|ИЗ
	|	ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|ГДЕ
	|	ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|	И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|	И (ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов В
	|				(ВЫБРАТЬ
	|					Т.ВалютаДокумента
	|				ИЗ
	|					ВТПлатежныеПозиции КАК Т)
	|			ИЛИ ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов = &Валюта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВалютаУпр,
	|	ДанныеОбъектаРасчетов.ОбъектРасчетов,
	|	ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|	ДанныеОбъектаРасчетов.Дата,
	|	ДанныеОбъектаРасчетов.КурсЧислительВалютыУправленческогоУчета,
	|	ДанныеОбъектаРасчетов.КурсЗнаменательВалютыУправленческогоУчета
	|ИЗ
	|	ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|ГДЕ
	|	ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|	И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|	И (&ВалютаУпр В
	|				(ВЫБРАТЬ
	|					Т.ВалютаДокумента
	|				ИЗ
	|					ВТПлатежныеПозиции КАК Т)
	|			ИЛИ &ВалютаУпр = &Валюта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов,
	|	ДанныеОбъектаРасчетов.ОбъектРасчетов,
	|	ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|	ДанныеОбъектаРасчетов.ПериодКурсаДоговора,
	|	ДанныеОбъектаРасчетов.КурсЧислительВалютыДоговора,
	|	ДанныеОбъектаРасчетов.КурсЗнаменательВалютыДоговора
	|ИЗ
	|	ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|ГДЕ
	|	ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|	И (ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов В
	|				(ВЫБРАТЬ
	|					Т.ВалютаДокумента
	|				ИЗ
	|					ВТПлатежныеПозиции КАК Т)
	|			ИЛИ ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов = &Валюта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТКурсыПредварительно.Валюта КАК Валюта,
	|	ВТКурсыПредварительно.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВТКурсыПредварительно.БазоваяВалюта КАК БазоваяВалюта,
	|	ВТКурсыПредварительно.ДатаКурса КАК ДатаКурса,
	|	ВТКурсыПредварительно.КурсЧислитель КАК КурсЧислитель,
	|	ВТКурсыПредварительно.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	ВТКурсыПредварительно КАК ВТКурсыПредварительно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтносительныеКурсыВалютСрезПоследних.Валюта,
	|	ВТПлатежныеПозиции.ОбъектРасчетов,
	|	ОтносительныеКурсыВалютСрезПоследних.БазоваяВалюта,
	|	ОтносительныеКурсыВалютСрезПоследних.Период,
	|	ОтносительныеКурсыВалютСрезПоследних.КурсЧислитель,
	|	ОтносительныеКурсыВалютСрезПоследних.КурсЗнаменатель
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
	|			&ПустаяДата {(&ПустаяДата)},
	|			БазоваяВалюта = &БазоваяВалюта
	|				И (Валюта В
	|						(ВЫБРАТЬ
	|							Т.ВалютаДокумента КАК ВалютаДокумента
	|						ИЗ
	|							ВТПлатежныеПозиции КАК Т
	|			
	|						ОБЪЕДИНИТЬ ВСЕ
	|			
	|						ВЫБРАТЬ
	|							Т.ВалютаДенежныхСредств
	|						ИЗ
	|							ВТПлатежныеПозиции КАК Т)
	|					ИЛИ Валюта = &Валюта)) КАК ОтносительныеКурсыВалютСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПлатежныеПозиции КАК ВТПлатежныеПозиции
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НЕ (ОтносительныеКурсыВалютСрезПоследних.Валюта, ВТПлатежныеПозиции.ОбъектРасчетов) В
	|				(ВЫБРАТЬ
	|					Т.Валюта,
	|					Т.ОбъектРасчетов
	|				ИЗ
	|					ВТКурсыПредварительно КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлатежныеПозиции.ПлатежнаяПозиция КАК ПлатежнаяПозиция,
	|	ПлатежныеПозиции.ПометкаУдаления КАК ПометкаУдаления,
	|	ПлатежныеПозиции.Номер КАК НомерПлатежнойПозиции,
	|	ПлатежныеПозиции.Дата КАК ДатаПлатежнойПозиции,
	|	ПлатежныеПозиции.РучнаяКорректировка КАК РучнаяКорректировка,
	|	ПлатежныеПозиции.ВидПлана КАК ВидПлана,
	|	ПлатежныеПозиции.БанковскийСчет КАК БанковскийСчет,
	|	ПлатежныеПозиции.Важность КАК Важность,
	|	ПлатежныеПозиции.ДатаПлан КАК ДатаПлан,
	|	ПлатежныеПозиции.ДатаПланКрайняя КАК ДатаПланКрайняя,
	|	ПлатежныеПозиции.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ПлатежныеПозиции.ДокументПланирования КАК ДокументПланирования,
	|	ПлатежныеПозиции.Касса КАК Касса,
	|	ПлатежныеПозиции.Контрагент КАК Контрагент,
	|	ПлатежныеПозиции.Организация КАК Организация,
	|	ПлатежныеПозиции.СтавкаНДС КАК СтавкаНДС,
	|	ПлатежныеПозиции.СтатьяОборотов КАК СтатьяОборотов,
	|	ПлатежныеПозиции.СуммаНДС КАК СуммаНДС,
	|	ПлатежныеПозиции.Сценарий КАК Сценарий,
	|	ПлатежныеПозиции.ФормаОплаты КАК ФормаОплаты,
	|	ПлатежныеПозиции.ЦФО КАК ЦФО,
	|	ПлатежныеПозиции.СтатусПозиции КАК СтатусПозиции,
	|	ПлатежныеПозиции.Проведен КАК ПозицияПроведен,
	|	ВТДанныеЗаявок.СтатусЗаявки КАК СтатусЗаявки,
	|	ПлатежныеПозиции.Аналитика_1 КАК Аналитика_1,
	|	ПлатежныеПозиции.Аналитика_2 КАК Аналитика_2,
	|	ПлатежныеПозиции.Аналитика_3 КАК Аналитика_3,
	|	ПлатежныеПозиции.Аналитика_4 КАК Аналитика_4,
	|	ПлатежныеПозиции.Аналитика_5 КАК Аналитика_5,
	|	ПлатежныеПозиции.Аналитика_6 КАК Аналитика_6,
	|	ПлатежныеПозиции.Аналитика_7 КАК Аналитика_7,
	|	ПлатежныеПозиции.Аналитика_8 КАК Аналитика_8,
	|	ПлатежныеПозиции.Аналитика_9 КАК Аналитика_9,
	|	ПлатежныеПозиции.Аналитика_11 КАК Аналитика_11,
	|	ПлатежныеПозиции.Аналитика_12 КАК Аналитика_12,
	|	ПлатежныеПозиции.Аналитика_10 КАК Аналитика_10,
	|	ВТВключеныВРеестр.УжеВключенаВРеестр КАК ВключенаВРеестр,
	|	ПлатежныеПозиции.ПозицияСостояние КАК ПозицияСостояние,
	|	ПлатежныеПозиции.СчетКасса КАК СчетКасса,
	|	ВТДанныеЗаявок.Важность КАК ЗаявкаВажность,
	|	ПлатежныеПозиции.ВалютаДокумента КАК ВалютаДокумента,
	|	ВТДанныеЗаявок.Дата КАК ЗаявкаДата,
	|	ВТДанныеЗаявок.Номер КАК ЗаявкаНомер,
	|	ВТДанныеЗаявок.ЗаявкаСостояние КАК ЗаявкаСостояние,
	|	ВТДанныеЗаявок.Ссылка КАК ЗаявкаПлатежнаяПозиция,
	|	ПлатежныеПозиции.НазначениеПлатежа КАК ПозицияНазначениеПлатежа,
	|	ПлатежныеПозиции.ВалютаДенежныхСредств КАК ВалютаПлатежа,
	|	ПлатежныеПозиции.Номер КАК ПозицияНомер,
	|	ПлатежныеПозиции.Дата КАК ПозицияДата,
	|	КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель / (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель) КАК КоэффициентПересчета,
	|	ВТОстаткиПозиций.Сумма КАК СуммаОстаток,
	|	ПлатежныеПозиции.СуммаДокумента КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА ПлатежныеПозиции.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов)
	|			ТОГДА ПлатежныеПозиции.СуммаВзаиморасчетов * КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель / (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель)
	|		ИНАЧЕ ПлатежныеПозиции.СуммаДокумента * КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель / (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель)
	|	КОНЕЦ КАК СуммаПлан,
	|	ВЫБОР
	|		КОГДА ПлатежныеПозиции.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов)
	|			ТОГДА ЕСТЬNULL(ВТОстаткиПозиций.Сумма, 0) * КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель / (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель)
	|		ИНАЧЕ ЕСТЬNULL(ВТОстаткиПозиций.Сумма, 0) * КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель / (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель)
	|	КОНЕЦ КАК СуммаКОплате,
	|	КурсВалюты.КурсЧислитель КАК КурсЧислительВзаиморасчетов,
	|	КурсВалюты.КурсЗнаменатель КАК КурсЗнаменательВзаиморасчетов,
	|	ПлатежныеПозиции.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	|	ПлатежныеПозиции.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	ВТПлатежныеПозиции КАК ПлатежныеПозиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВключеныВРеестр КАК ВТВключеныВРеестр
	|		ПО ПлатежныеПозиции.ПлатежнаяПозиция = ВТВключеныВРеестр.ПлатежнаяПозиция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиПозиций КАК ВТОстаткиПозиций
	|		ПО ПлатежныеПозиции.ПлатежнаяПозиция = ВТОстаткиПозиций.ПлатежнаяПозиция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеЗаявок КАК ВТДанныеЗаявок
	|		ПО ПлатежныеПозиции.ДокументПланирования = ВТДанныеЗаявок.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК СтатусыЗаявок
	|		ПО (ВТДанныеЗаявок.Ссылка = СтатусыЗаявок.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалюты
	|		ПО ПлатежныеПозиции.ВалютаДокумента = КурсВалюты.Валюта
	|			И ПлатежныеПозиции.ОбъектРасчетов = КурсВалюты.ОбъектРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютыПересчета
	|		ПО ПлатежныеПозиции.ВалютаДенежныхСредств = КурсВалютыПересчета.Валюта
	|			И ПлатежныеПозиции.ОбъектРасчетов = КурсВалютыПересчета.ОбъектРасчетов";
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Если ВыбранныеДокументы.Количество() > 1 Тогда
			ТекстСообщения = НСтр("ru = 'По выбранным документам нет сумм к выплате через реестр платежей.'");
		Иначе
			ПлатежнаяВедомость = ВыбранныеДокументы[0];
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'В документе %1 нет сумм к выплате через реестр платежей.'"), ПлатежнаяВедомость);
		КонецЕсли;
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ОрганизацииСписка = Новый Массив;
	Выборка			  = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаПлатежи.Добавить(), Выборка);
		ОрганизацииСписка.Добавить(Выборка.Организация);
	КонецЦикла;	

	ОрганизацииСписка = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ОрганизацииСписка);
	Если ОрганизацииСписка.Количество() = 1 Тогда
		Организация = ОрганизацииСписка[0];	
	КонецЕсли;	

КонецПроцедуры
 
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
